test-results/ab_counter_20260419_142707.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100000 requests
Completed 200000 requests
Completed 300000 requests
Completed 400000 requests
Completed 500000 requests
Completed 600000 requests
Completed 700000 requests
Completed 800000 requests
Completed 900000 requests
Completed 1000000 requests
Finished 1000000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /api/counter/data
Document Length:        253 bytes

Concurrency Level:      100
Time taken for tests:   214.778 seconds
Complete requests:      1000000
Failed requests:        999613
   (Connect: 0, Receive: 0, Length: 999613, Exceptions: 0)
Non-2xx responses:      999613
Total transferred:      553736705 bytes
HTML transferred:       173891394 bytes
Requests per second:    4655.97 [#/sec] (mean)
Time per request:       21.478 [ms] (mean)
Time per request:       0.215 [ms] (mean, across all concurrent requests)
Transfer rate:          2517.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0      91
Processing:     1   21   9.5     18     234
Waiting:        1   21   9.5     18     234
Total:          3   21   9.5     18     234

Percentage of the requests served within a certain time (ms)
  50%     18
  66%     22
  75%     25
  80%     27
  90%     32
  95%     39
  98%     49
  99%     57
 100%    234 (longest request)