test-results/ab_cpu_20260419_142707.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100000 requests
Completed 200000 requests
Completed 300000 requests
Completed 400000 requests
Completed 500000 requests
Completed 600000 requests
Completed 700000 requests
Completed 800000 requests
Completed 900000 requests
Completed 1000000 requests
Finished 1000000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /api/cpu/data
Document Length:        448 bytes

Concurrency Level:      100
Time taken for tests:   153.694 seconds
Complete requests:      1000000
Failed requests:        999900
   (Connect: 0, Receive: 0, Length: 999900, Exceptions: 0)
Non-2xx responses:      999700
Total transferred:      947452249 bytes
HTML transferred:       459200925 bytes
Requests per second:    6506.44 [#/sec] (mean)
Time per request:       15.369 [ms] (mean)
Time per request:       0.154 [ms] (mean, across all concurrent requests)
Transfer rate:          6020.06 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0      61
Processing:     1   15   8.5     13     321
Waiting:        0   15   8.5     13     321
Total:          2   15   8.5     13     322

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     14
  75%     16
  80%     17
  90%     22
  95%     28
  98%     37
  99%     43
 100%    322 (longest request)