test-results/ab_fixed_20260419_142707.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100000 requests
Completed 200000 requests
Completed 300000 requests
Completed 400000 requests
Completed 500000 requests
Completed 600000 requests
Completed 700000 requests
Completed 800000 requests
Completed 900000 requests
Completed 1000000 requests
Finished 1000000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /api/fixed/data
Document Length:        215 bytes

Concurrency Level:      100
Time taken for tests:   92.765 seconds
Complete requests:      1000000
Failed requests:        999900
   (Connect: 0, Receive: 0, Length: 999900, Exceptions: 0)
Non-2xx responses:      999900
Total transferred:      544796914 bytes
HTML transferred:       173902062 bytes
Requests per second:    10779.94 [#/sec] (mean)
Time per request:       9.276 [ms] (mean)
Time per request:       0.093 [ms] (mean, across all concurrent requests)
Transfer rate:          5735.23 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0      72
Processing:     1    9  25.3      8    2396
Waiting:        1    9  25.3      8    2396
Total:          2    9  25.3      8    2396

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      9
  75%      9
  80%      9
  90%     10
  95%     15
  98%     21
  99%     29
 100%   2396 (longest request)