test-results/ab_hybrid_20260419_142707.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100000 requests
Completed 200000 requests
Completed 300000 requests
Completed 400000 requests
Completed 500000 requests
Completed 600000 requests
Completed 700000 requests
Completed 800000 requests
Completed 900000 requests
Completed 1000000 requests
Finished 1000000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /api/hybrid/data
Document Length:        543 bytes

Concurrency Level:      100
Time taken for tests:   157.710 seconds
Complete requests:      1000000
Failed requests:        999999
   (Connect: 0, Receive: 0, Length: 999999, Exceptions: 0)
Non-2xx responses:      999677
Total transferred:      1206530112 bytes
HTML transferred:       719520851 bytes
Requests per second:    6340.76 [#/sec] (mean)
Time per request:       15.771 [ms] (mean)
Time per request:       0.158 [ms] (mean, across all concurrent requests)
Transfer rate:          7471.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0      60
Processing:     1   16  10.6     14     683
Waiting:        1   16  10.6     14     683
Total:          3   16  10.6     14     683

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     15
  75%     16
  80%     17
  90%     22
  95%     28
  98%     35
  99%     41
 100%    683 (longest request)