test-results/ab_leaky_20260419_142707.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100000 requests
Completed 200000 requests
Completed 300000 requests
Completed 400000 requests
Completed 500000 requests
Completed 600000 requests
Completed 700000 requests
Completed 800000 requests
Completed 900000 requests
Completed 1000000 requests
Finished 1000000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /api/leaky/data
Document Length:        219 bytes

Concurrency Level:      100
Time taken for tests:   128.046 seconds
Complete requests:      1000000
Failed requests:        999700
   (Connect: 0, Receive: 0, Length: 999700, Exceptions: 0)
Non-2xx responses:      999700
Total transferred:      543006570 bytes
HTML transferred:       173014700 bytes
Requests per second:    7809.67 [#/sec] (mean)
Time per request:       12.805 [ms] (mean)
Time per request:       0.128 [ms] (mean, across all concurrent requests)
Transfer rate:          4141.31 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0      55
Processing:     1   13   4.8     12      90
Waiting:        0   13   4.8     12      90
Total:          2   13   4.8     12      90

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     12
  75%     13
  80%     13
  90%     16
  95%     21
  98%     29
  99%     35
 100%     90 (longest request)