test-results/ab_ml_20260419_142707.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100000 requests
Completed 200000 requests
Completed 300000 requests
Completed 400000 requests
Completed 500000 requests
Completed 600000 requests
Completed 700000 requests
Completed 800000 requests
Completed 900000 requests
Completed 1000000 requests
Finished 1000000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /api/ml/data
Document Length:        402 bytes

Concurrency Level:      100
Time taken for tests:   242.859 seconds
Complete requests:      1000000
Failed requests:        999990
   (Connect: 0, Receive: 0, Length: 999990, Exceptions: 0)
Non-2xx responses:      999737
Total transferred:      909967778 bytes
HTML transferred:       453975746 bytes
Requests per second:    4117.62 [#/sec] (mean)
Time per request:       24.286 [ms] (mean)
Time per request:       0.243 [ms] (mean, across all concurrent requests)
Transfer rate:          3659.08 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0      48
Processing:     1   24  22.7     20    1920
Waiting:        1   24  22.7     20    1920
Total:          2   24  22.7     21    1921

Percentage of the requests served within a certain time (ms)
  50%     21
  66%     23
  75%     26
  80%     29
  90%     37
  95%     46
  98%     59
  99%     71
 100%   1921 (longest request)