test-results/ab_reputation_20260419_142707.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100000 requests
Completed 200000 requests
Completed 300000 requests
Completed 400000 requests
Completed 500000 requests
Completed 600000 requests
Completed 700000 requests
Completed 800000 requests
Completed 900000 requests
Completed 1000000 requests
Finished 1000000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /api/reputation/data
Document Length:        579 bytes

Concurrency Level:      100
Time taken for tests:   156.324 seconds
Complete requests:      1000000
Failed requests:        999999
   (Connect: 0, Receive: 0, Length: 999999, Exceptions: 0)
Non-2xx responses:      999829
Total transferred:      831307271 bytes
HTML transferred:       336059091 bytes
Requests per second:    6396.97 [#/sec] (mean)
Time per request:       15.632 [ms] (mean)
Time per request:       0.156 [ms] (mean, across all concurrent requests)
Transfer rate:          5193.21 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0      54
Processing:     1   15  14.9     14    1367
Waiting:        1   15  14.9     14    1367
Total:          2   16  14.9     14    1367

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     15
  75%     16
  80%     17
  90%     22
  95%     27
  98%     35
  99%     41
 100%   1367 (longest request)