test-results/ab_sliding_20260419_142707.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100000 requests
Completed 200000 requests
Completed 300000 requests
Completed 400000 requests
Completed 500000 requests
Completed 600000 requests
Completed 700000 requests
Completed 800000 requests
Completed 900000 requests
Completed 1000000 requests
Finished 1000000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /api/sliding/data
Document Length:        221 bytes

Concurrency Level:      100
Time taken for tests:   160.298 seconds
Complete requests:      1000000
Failed requests:        999700
   (Connect: 0, Receive: 0, Length: 999700, Exceptions: 0)
Non-2xx responses:      999700
Total transferred:      549767244 bytes
HTML transferred:       173896087 bytes
Requests per second:    6238.40 [#/sec] (mean)
Time per request:       16.030 [ms] (mean)
Time per request:       0.160 [ms] (mean, across all concurrent requests)
Transfer rate:          3349.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0      47
Processing:     1   16   9.0     14     186
Waiting:        0   16   9.0     13     186
Total:          2   16   9.0     14     186

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     16
  75%     17
  80%     19
  90%     25
  95%     33
  98%     42
  99%     51
 100%    186 (longest request)